# IBM SQL for Data Science

## DDL（Data Definition Language) Statements:
- Define, Change or Drop Data

DDL or Data Definition Language statements are used for defining or changing objects in a database such as **tables**.

Common DDL:
- CREATE: Creating tables and defining its columns
- ALTER: Altering tables including adding and dropping columns and modifying their datatypes
- TRUNCATE: Deleting data in a table but not the table itself
- DROP: Deleting tables

## DML（Data Manipulation Language) Statements:
- Read and Modify Data
- CRUD operations (Create,Read,Update,Delete rows)

DML or Data Manipulation Language statements are used for manipulating or working with **data** in tables.

Common DML:
- INSERT: Inserting a row or several rows of data into a table;
- SELECT: Reads or selects row or rows from a table
- UPDATE: Edits row or rows in a table;
- DELETE: Removes a row or rows of data from a table.

## DML-SELECT Statement

### Useful Built-In Functions Used with SELECT Statements

## COUNT

COUNT is a built-in database function that retrieves the number of rows that match the query criteria.

Rows in the MEDALS table where Country is Canada

In [ ]:
SELECT COUNT (COUNTRY) FROM MEDALS
WHERE COUNTRY = "CANADA";

Retrieve the number of locations of the films which are directed by Woody Allen.

In [ ]:
SELECT COUNT(Locations) FROM FilmLocations WHERE Director="Woody Allen";

Retrieve the number of films shot at Russian Hill.

In [ ]:
SELECT Count(Title) FROM FilmLocations WHERE Locations="Russian Hill";

Retrieve the number of rows having a release year older than 1950 from the "FilmLocations" table.

In [ ]:
SELECT Count(*) FROM FilmLocations WHERE ReleaseYear<1950;

## DISTINCT

DISTINCT is used to remove duplicate values from a result set.

A country may have received a gold medal multiple times.
Example, retrieve the list of unique countries that received gold medals.
That is, removing all duplicate values of the same country.

In [ ]:
SELECT DISTINCT COUNTRY FROM MEDALS
WHERE MEDALTYPE="GOLD";

Retrieve the name of all films without any repeated titles.

In [ ]:
SELECT DISTINCT Title FROM FilmLocations;

Retrieve the number of release years of the films distinctly, produced by Warner Bros. Pictures.

In [ ]:
SELECT COUNT (DISTINCT ReleaseYear) FROM FilmLocations
WHERE ProductionCompany="Warner Bros. Pictures";

Retrieve the name of all unique films released in the 21st century and onwards, along with their release years.

In [ ]:
SELECT DISTINCT Title, ReleaseYear FROM FilmLocations WHERE ReleaseYear>=2001;

Retrieve the names of all the directors and their distinct films shot at City Hall.

In [ ]:
SELECT DISTINCT Title, Director FROM FilmLocations WHERE Locations="City Hall";

Retrieve the number of distributors distinctly who distributed films acted by Clint Eastwood as 1st actor.

In [ ]:
SELECT COUNT(DISTINCT Distributor) FROM FilmLocations WHERE Actor1="Clint Eastwood";

## LIMIT

LIMIT is used for restricting the number of rows retrieved from the database.

Example, retrieve just a few rows in the MEDALS table for a particular year.

In [ ]:
SELECT * FROM MEDALS
WHERE YEAR = 2018 LIMIT 5;

Retrieve the first 25 rows from the "FilmLocations" table.

In [ ]:
SELECT * FROM FilmLocations LIMIT 25;

Retrieve the first 15 rows from the "FilmLocations" table starting **from row 11**.

In [ ]:
SELECT * FROM FilmLocations LIMIT 15 OFFSET 10;

Retrieve the name of first 50 films distinctly.

In [ ]:
SELECT DISTINCT Title FROM FilmLocations LIMIT 50;

Retrieve first 10 film names distinctly released in 2015.

In [ ]:
SELECT DISTINCT Title FROM FilmLocations WHERE ReleaseYear=2015 LIMIT 10;

Retrieve the next 3 film names distinctly **after first 5 films** released in 2015.

In [ ]:
SELECT DISTINCT Title FROM FilmLocations WHERE ReleaseYear=2015 LIMIT 3 OFFSET 5;

## Database: Instructor

Instructor (
    ins_id:     unique identification number of the instructors,    
    lastname:   last name of the instructors,
    firstname:  first name of the instructors,
    city:       name of the cities where instructors are located,
    country:    two-letter country code of the countries where instructors are located
)

## INSERT Statement

In [ ]:
INSERT INTO table_name (column1, column2, ... )
VALUES (value1, value2, ... )
;

In [ ]:
INSERT INTO AUTHOR
    (AUTHOR_ID,LASTNAME,FIRSTNAME,EMAIL,CITY,COUNTRY)
VALUES('A1','CHONG','RAUL','FRG@IBM.COM','TORONTO','CA'),
      ('A2','LIM','RAY','LIM@IBM.COM','TORONTO','CA')
;

Insert a new instructor record with id 4 for Sandip Saha who lives in Edmonton, CA into the "Instructor" table.

In [ ]:
INSERT INTO Instructor (ins_id,lastname,firstname,city,country)
VALUES (4,'Saha','Sandip','Edmonton','CA');

SELECT * FROM Instructor;

Insert two new instructor records into the "Instructor" table. 
First record with id 5 for John Doe who lives in Sydney, AU. 
Second record with id 6 for Jane Doe who lives in Dhaka, BD.

In [ ]:
INSERT INTO Instructor (ins_id,lastname,firstname,city,country)
VALUES (5,'Doe','John','Sydney','AU'),
       (6,'Doe','Jane','Dhaka','BD');
    
SELECT * FROM Instructor;

Insert a new instructor record with id 7 for Antonio Cangiano who lives in Vancouver, CA into the "Instructor" table.

In [ ]:
INSERT INTO Instructor(ins_id, lastname, firstname, city, country)
VALUES(7, 'Cangiano', 'Antonio', 'Vancouver', 'CA');

SELECT * FROM Instructor;

Insert two new instructor records into the "Instructor" table. First record with id 8 for Steve Ryan who lives in Barlby, GB. Second record with id 9 for Ramesh Sannareddy who lives in Hyderabad, IN.

In [ ]:
INSERT INTO Instructor(ins_id, lastname, firstname, city, country)
VALUES(8, 'Ryan', 'Steve', 'Barlby', 'GB'), 
(9, 'Sannareddy', 'Ramesh', 'Hyderabad', 'IN');

SELECT * FROM Instructor;

## DML: UPDATE Statement - Altering rows of a table

**Note that if you do not specify the WHERE clause, all the rows in the table will be updated.**

In [ ]:
UPDATE table_name
SET column1 = value1, column2 = value2, ...
WHERE condition
;

To change the first name and last name to Lakshmi Katta, where the author ID is equal to A2

In [ ]:
UPDATE AUTHOR
SET LASTNAME='KATTA',FIRSTNAME='LAKSHMI'
WHERE AUTHOR_ID='A2';

Update the city for Sandip to Toronto.

In [ ]:
UPDATE Instructor
SET city ='Toronto'
WHERE firstname = 'Sandip';

SELECT * FROM Instructor;

Update the city and country for Doe with id 5 to Dubai and AE respectively.

In [ ]:
UPDATE Instructor 
SET city='Dubai', country='AE' 
WHERE ins_id=5;

SELECT * FROM Instructor;

Update the city of the instructor record to Markham whose id is 1.

In [ ]:
UPDATE Instructor 
SET city='Markham' 
WHERE ins_id=1;

SELECT * FROM Instructor;

Update the city and country for Sandip with id 4 to Dhaka and BD respectively.

In [ ]:
UPDATE Instructor 
SET city='Dhaka', country='BD' 
WHERE ins_id=4;

SELECT * FROM Instructor;

## DML: DELETE Statement - Deleting rows from a table

**Note that if you do not specify the WHERE clause, all the rows in the table will be removed.**

In [ ]:
DELETE FROM table_name
WHERE condition
;

Based on the author entity example, we want to delete the rows for author ID A2 and A3.

In [ ]:
DELETE FROM AUTHOR
WHERE AUTHOR_ID IN ('A2','A3');

Remove the instructor record of Doe whose id is 6.

In [ ]:
DELETE FROM instructor
WHERE ins_id = 6;

SELECT * FROM Instructor;

Remove the instructor record of Hima.

In [ ]:
DELETE FROM instructor
WHERE firstname = 'Hima';

SELECT * FROM Instructor;

# Relational Database Concept

- Key advantage of the relational model is logical and physical data independence and storage independence.
- Entities are independent objects which can have multiple characteristics called attributes.
- When mapping to a relational database, entities are represented as tables and attributes map to columns.
- Common data types include characters such as Char and Varchar, numbers such as integer and decimal, and timestamps including date and time.
- A primary key uniquely identifies a specific row in a table and prevents duplication of data.

## CREATE TABLE Statement

- CREATE is a DDL statement for creating Entities or tables in a database.
- The CREATE TABLE statement includes definition of attributes of columns in the table, including
    - Names of columns
    - Datatypes of columns
    - Primary Key constraint

 **the database does not allow Primary Keys to have NULL values.**

CREATE TABLE author (
    author_id CHAR(2) PRIMARY KEY NOT NULL,
    lastname VARCHAR(15) NOT NULL,
    firstname VARCHAR(15) NOT NULL,
    email VARCHAR(40),
    city VARCHAR(15),
    country CHAR(2)
)

In [ ]:
CREATE TABLE PETSALE (
    ID INTEGER NOT NULL,
    PET CHAR(20),
    SALEPRICE DECIMAL(6,2),
    PROFIT DECIMAL(6,2),
    SALEDATE DATE
    );
    
CREATE TABLE PET (
    ID INTEGER NOT NULL,
    ANIMAL VARCHAR(20),
    QUANTITY INTEGER
    );

INSERT INTO PETSALE VALUES
    (1,'Cat',450.09,100.47,'2018-05-29'),
    (2,'Dog',666.66,150.76,'2018-06-01'),
    (3,'Parrot',50.00,8.9,'2018-06-04'),
    (4,'Hamster',60.60,12,'2018-06-11'),
    (5,'Goldfish',48.48,3.5,'2018-06-14');
    
INSERT INTO PET VALUES
    (1,'Cat',3),
    (2,'Dog',4),
    (3,'Hamster',2);
    
SELECT * FROM PETSALE;
SELECT * FROM PET;

## ALTER

Changes the structure of an existing table:
- Add or remove columns
- Modify the data type of columns
- Add or remove keys
- Add or remove constraints

How does the syntax of an ALTER statement look?

ALTER TABLE table_name
ADD COLUMN column_name data_type column_constraint;

ALTER TABLE table_name
DROP COLUMN column_name;

ALTER TABLE table_name
ALTER COLUMN column_name SET DATA TYPE data_type;

ALTER TABLE table_name
RENAME COLUMN current_column_name TO new_column_name;

### ALTER TABLE using ADD COLUMN

In [ ]:
ALTER TABLE author
    ADD COLUMN telephone_number BIGINT;

In [ ]:
ALTER TABLE PETSALE
ADD COLUMN QUANTITY INTEGER;

SELECT * FROM PETSALE;

In [ ]:
UPDATE PETSALE SET QUANTITY = 9 WHERE ID = 1;
UPDATE PETSALE SET QUANTITY = 3 WHERE ID = 2;
UPDATE PETSALE SET QUANTITY = 2 WHERE ID = 3;
UPDATE PETSALE SET QUANTITY = 6 WHERE ID = 4;
UPDATE PETSALE SET QUANTITY = 24 WHERE ID = 5;

SELECT * FROM PETSALE;

### ALTER TABLE using ALTER COLUMN

In [ ]:
ALTER TABLE author
    ALTER COLUMN telephone_number SET DATA TYPE
CHAR(20);

In [ ]:
ALTER TABLE PETSALE
ALTER COLUMN PET SET DATA TYPE VARCHAR(20);

SELECT * FROM PETSALE;

### ALTER TABLE using DROP COLUMN

In [ ]:
ALTER TABLE author
    DROP COLUMN telephone_number;

In [ ]:
ALTER TABLE PETSALE
ADD COLUMN QUANTITY INTEGER;

SELECT * FROM PETSALE;

### ALTER TABLE using RENAME COLUMN

In [ ]:
ALTER TABLE PETSALE
RENAME COLUMN PET TO ANIMAL;

SELECT * FROM PETSALE;

## DROP TABLE

- Delete an existing table

In [ ]:
DROP TABLE author;

## TRUNCATE TABLE

- Sometimes you may want to delete the data in a table rather than deleting the table itself.
- Delete all rows of data in a table.
- The IMMEDIATE specifies to process the statement immediately and that it cannot be undone

In [ ]:
TRUNCATE TABLE author
 IMMEDIATE;

In [ ]:
TRUNCATE TABLE PET IMMEDIATE;

SELECT * FROM PET;

## Module3: Intermediate SQL

### 3.1 String Patterns, Sorting&Grouping

Congratulations! At this point in the course, you know:

- You can use the WHERE clause to refine your query results.
- You can use the wildcard character (%) as a substitute for unknown characters in a pattern.
- You can use BETWEEN ... AND ... to specify a range of numbers.
- You can sort query results into ascending or descending order, using the ORDER BY clause to specify the column to sort on.
- You can group query results by using the GROUP BY clause.

HR Database
- We will be working on a sample HR database for this Lab. 
- This HR database schema consists of 5 tables called EMPLOYEES, JOB_HISTORY, JOBS, DEPARTMENTS and LOCATIONS.
- Each table has a few rows of sample data The following diagram shows the tables for the HR database.

Query 1: Retrieve all employees whose address is in Elgin,IL

In [ ]:
select F_NAME , L_NAME
from EMPLOYEES
where ADDRESS LIKE '%Elgin,IL%' ;

Query 2: Retrieve all employees who were born during the 1970's.

In [ ]:
select F_NAME , L_NAME
from EMPLOYEES
where B_DATE LIKE '197%' ;

Query 3: Retrieve all employees in department 5 whose salary is between 60000 and 70000 .

In [ ]:
select *
from EMPLOYEES
where (SALARY BETWEEN 60000 and 70000)  and DEP_ID = 5 ;

Query 4A: Retrieve a list of employees ordered by department ID.

In [ ]:
select F_NAME, L_NAME, DEP_ID 
from EMPLOYEES
order by DEP_ID;

Query 4B: Retrieve a list of employees ordered in descending order by department ID and within each department ordered alphabetically in descending order by last name.

In [ ]:
select F_NAME, L_NAME, DEP_ID 
from EMPLOYEES
order by DEP_ID desc, L_NAME desc;

Query 5A: For each department ID retrieve the number of employees in the department.

In [ ]:
SELECT DEP_ID, COUNT(*) AS "NO OF EMPLOYEES"
FROM EMPLOYEES
GROUP BY DEP_ID;

Query 5B: For each department retrieve the number of employees in the department, and the average employees salary in the department.

In [ ]:
SELECT DEP_ID, COUNT(*),AVG(SALARY) 
FROM EMPLOYEES
GROUP BY DEP_ID;

Query 5C: Label the computed columns in the result set of Query 5B as NUM_EMPLOYEES and AVG_SALARY.

In [ ]:
SELECT DEP_ID, COUNT(*) AS "NUM_EMPLOYEES",AVG(SALARY) AS "AVG_SALARY"
FROM EMPLOYEES
GROUP BY DEP_ID;

Query 5D: In Query 5C order the result set by Average Salary.

In [ ]:
SELECT DEP_ID, COUNT(*) AS "NUM_EMPLOYEES",AVG(SALARY) AS "AVG_SALARY"
FROM EMPLOYEES
GROUP BY DEP_ID
ORDER BY AVG_SALARY;

Query 5E: In Query 5D limit the result to departments with fewer than 4 employees.

Hint: Use HAVING after the GROUP BY, and use the count() function in the HAVING clause instead of the column label.

In [ ]:
SELECT DEP_ID, COUNT(*) AS "NUM_EMPLOYEES",AVG(SALARY) AS "AVG_SALARY"
FROM EMPLOYEES
GROUP BY DEP_ID
HAVING COUNT(*) < 4 
ORDER BY AVG_SALARY;

--5E alternative: if you want to use the label

In [ ]:
select DEP_ID, NUM_EMPLOYEES, AVG_SALARY from
  (select DEP_ID, COUNT(*) AS NUM_EMPLOYEES, AVG(SALARY) AS AVG_SALARY from EMPLOYEES group by DEP_ID)
  where NUM_EMPLOYEES < 4
order by AVG_SALARY;

BONUS Query 6: Similar to 4B but instead of department ID use department name. Retrieve a list of employees ordered by department name, and within each department ordered alphabetically in descending order by last name.

In [ ]:
select D.DEP_NAME , E.F_NAME, E.L_NAME
from EMPLOYEES as E, DEPARTMENTS as D
where E.DEP_ID = D.DEPT_ID_DEP
order by D.DEP_NAME, E.L_NAME desc ;

### 3.2 Built-in Database Functions

### 3.2.1 Aggregate or Column Functions

- INPUT: Collection of values(e.g entire column)
- OUTPUT: Single Value
- Examples:
    - SUM()
    - MIN()
    - MAX()
    - AVG()

- Mathematical operations can be performed between columns
    - eg. Calculate the average cost *per* dog

SELECT AVG(COST/QUANTITY) from PETRESCUE
WHERE ANIMAL = 'Dog';

Query A1: Enter a function that calculates the total cost of all animal rescues in the PETRESCUE table.

In [ ]:
select SUM(COST) from PETRESCUE;

Query A2: Enter a function that displays the total cost of all animal rescues in the PETRESCUE table in a column called SUM_OF_COST.

In [ ]:
select SUM(COST) AS SUM_OF_COST from PETRESCUE;

Query A3: Enter a function that displays the maximum quantity of animals rescued.

In [ ]:
select MAX(QUANTITY) from PETRESCUE;

Query A4: Enter a function that displays the average cost of animals rescued.

In [ ]:
select AVG(COST) from PETRESCUE;

Query A5: Enter a function that displays the average cost of rescuing a dog.

In [ ]:
select AVG(COST/QUANTITY) from PETRESCUE
where ANIMAL = 'Dog';

### 3.2.2 SCALAR and STRING Functions

SCALAR: Perform operations on every *INPUT* value
- ROUND()
- LENGTH()
- UCASE
- LCASE

Query B1: Enter a function that displays the rounded cost of each rescue.

In [ ]:
select ROUND(COST) from PETRESCUE;

Query B2: Enter a function that displays the length of each animal name.

In [ ]:
select length(ANIMAL) from PETRESCUE;

Query B3: Enter a function that displays the animal name in each rescue in uppercase.

In [ ]:
select UCASE(ANIMAL) from PETRESCUE;

Query B4: Enter a function that displays the animal name in each rescue in uppercase without duplications.

In [ ]:
select DISTINCT (UCASE(ANIMAL)) from PETRESCUE;

Query B5: Enter a query that displays all the columns from the PETRESCUE table, where the animal(s) rescued are cats. Use cat in lower case in the query.

In [ ]:
select * from PETRESCUE
where LCase(ANIMAL) = 'cat';

### 3.2.3 Date, Time Functions

- DATE: YYMMDD
- TIME: HHMMSS
- TIMESTAMP: YYYYXXDDHHMMSSZZZZZZ
- DATE/TIME Functions:
    - YEAR()
    - MONTH()
    - DAY()
    - DAYOFMONTH()
    - DAYOFWEEK()
    - DAYOFYEAR()
    - WEEK()
    - HOUR()
    - MINUTE()
    - SECOND()

### 3.2.4 Date or Time Arithmetic

special Registers:
- CURRENT_DATE
- CURRENT_TIME

Query C1: Enter a function that displays the day of the month when cats have been rescued.

In [ ]:
select DAY(RESCUEDATE) AS "DAY_OF_MONTH" from PETRESCUE
where ANIMAL = 'Cat';

Query C2: Enter a function that displays the number of rescues on the 5th month.

In [ ]:
select SUM(QUANTITY) from PETRESCUE where MONTH(RESCUEDATE)='05';

Query C3: Enter a function that displays the number of rescues on the 14th day of the month.

In [ ]:
select SUM(QUANTITY) from PETRESCUE where DAY(RESCUEDATE)='14';

Query C4: Animals rescued should see the vet within three days of arrivals. Enter a function that displays the third day from each rescue.

In [ ]:
select (RESCUEDATE + 3 DAYS) from PETRESCUE;

Query C5: Enter a function that displays the length of time the animals have been rescued; the difference between today’s date and the recue date.

In [ ]:
select (CURRENT_DATE - RESCUEDATE) from PETRESCUE;

## 4.0 Sub-Queries and Nested Selects

### 4.1.1 Sub-queries to evaluate Aggregate functions in WHERE clause

- **Cannot evaluate *Aggregate functions* like ACG() in the WHERE clause**.
- Therefore, use a sub-select expression

*Q1: Execute a **failing query** (i.e. one which gives an error) to retrieve all employees records whose salary is lower than the average salary.*

In [ ]:
WRONG:

select * from employees
where salary < **AVG(salary)**

*Q2: Execute a **working query using a sub-select** to retrieve all employees records whose salary is lower than the average salary.*

In [ ]:
CORRECT:

select EMP_ID, F_NAME, L_NAME, SALARY from employees
where salary < (select AVG(SALARY) from employees);

### 4.1.2 Subqueries in list of columns

- Subsitiue column name with a sub-query
- Called Column Expressions

In [ ]:
WRONG: 

select EMP_ID,SALARY,AVG(SALARY) AS AVG_SALARY
from employees;

In [ ]:
CORRECT:
    
select EMP_ID, SALARY, 
(select AVG(SALARY) from employees AS AVG_SALARY)
from employees;

*Q3: Execute a **failing query** (i.e. one which gives an error) to retrieve all employees records with EMP_ID, SALARY and maximum salary as MAX_SALARY in every row.*

In [ ]:
select EMP_ID,SALARY,MAX(SALARY) AS MAX_SALARY
from employees;

*Q4: Execute a **Column Expression** that retrieves all employees records with EMP_ID, SALARY and maximum salary as MAX_SALARY in every row.*

In [ ]:
select EMP_ID,SALARY, (SELECT MAX(SALARY) from employees AS MAX_SALARY)
from employees;

### 4.1.3 Sub-queries in FROM clause

- Substitue the TABLE name with a sub-query
- Called Derived Tables or Table Expressions

*Q5: Execute a **Table Expression** for the EMPLOYEES table that excludes columns with sensitive employee data (i.e. does not include columns: SSN, B_DATE, SEX, ADDRESS, SALARY).*

- The derived table in a sub-query does not include sensitive fields like date of birth or salary.
-  such derived tables can prove to be powerful in more complex situations such as when working with multiple tables and doing joins.

In [ ]:
select * from (select EMP_ID,F_NAME, L_NAME, DEP_ID from employees) AS EMP4ALL;

## 5.0 Working with Multiple Tables

Ways to access multiple tables in the same query:
1. Sub-queries
2. Implicit JOIN
3. JOIN Operaters(INNER JOIN, OUTER JOIN)

### 5.1.1 Accessing Multiple Tables with Sub-queries

- Compose queries that **access multiple tables** using a nested statement in the WHERE clause

*Retrieve only the employee records that **correspond** to departments in the DEPARTMENTS table*

In [ ]:
select * from employees where DEP_ID IN (select DEPT_ID_DEP from departments);

*Retrieve only the list of employees from a specific location.*
- EMPLOYEES table does not contain location information
- Need to get location info from DEPARTMENT tables

In [ ]:
select * from employees where DEP_ID IN (select DEPT_ID_DEP from departments where LOC_ID = 'L0002');

*Retrieve the department ID and department name for employees who earn more than $70,000.*

To do so, we will need a sub-query on the employees table to satisfy the salary criteria,and then feed it as input to an outer query on the departments table in order to get the matching department info

In [ ]:
select DEPT_ID_DEP, DEP_NAME from DEPARTMENTS 
where DEPT_ID_DEP IN (select DEP_ID from employees where SALARY> 70000 );

Exercise:

*Q1: Retrieve only the EMPLOYEES records that correspond to jobs in the JOBS table.*

In [ ]:
select * from employees where JOB_ID IN (select JOB_IDENT from jobs);

*Q2: Retrieve only the list of employees whose JOB_TITLE is Jr. Designer.*

In [ ]:
select * from employees where JOB_ID IN (select JOB_IDENT from jobs where JOB_TITLE='Jr.Designer');

*Q3: Retrieve JOB information and who earn more than $70,000.*

In [ ]:
select JOB_TITLE, MIN_SALARY, MAX_SALARY, JOB_IDENT from jobs where JOB_IDENT IN (select JOB_ID from employees where salary > 70000);

*Q4: Retrieve JOB information and whose birth year is after 1976.*

In [ ]:
select * from jobs where JOB_IDENT IN (select JOB_ID from employees where YEAR(B_DATE) > 1976);

*Q5: Retrieve JOB information for female employees whose birth year is after 1976.*

In [ ]:
select * from jobs where JOB_IDENT IN (select JOB_ID from employees where YEAR(B_DATE) > 1976 and SEX='F' );

### 5.1.2 Accessing multiple tables with Implicit Join

- Write Implicit Join queries with join criteria specified in the WHERE clause

**How does an Implicit version of CROSS JOIN (also known as Cartesian Join) statement syntax look?**

- Specify 2 tables in the FROM clause:

In [ ]:
SELECT column_name(s)
FROM table1, table2;

In [ ]:
select * from employees,departments;

- The result is a full join ( Cartesian join):
    - EVERY ROW in the first table is joined with EVERY ROW in the second table
- The result set will have more rows than in both tables

Use additional operands to limit the result set:

**How does an Implicit version of INNER JOIN statement syntax look?**

In [ ]:
SELECT column_name(s)
FROM table1, table2
WHERE table1.column_name = table2.column_name;

In [ ]:
select E.EMP_ID, D.DEPT_ID_DEP
from employees E , departments D
where E.DEP_ID = D.DEPT_ID_DEP;

*To see the department name for each employee*

In [ ]:
select EMP_ID, DEP_NAME 
from employees E , departments D
where E.DEP_ID = D.DEPT_ID_DEP;

Exercise

*Q1: Perform an implicit cartesian/cross join between EMPLOYEES and JOBS tables.*

In [ ]:
select * from employees, jobs;

*Q2: Retrieve only the EMPLOYEES records that correspond to jobs in the JOBS table.*

In [ ]:
select * from employees, jobs;
where employees.JOB_ID = jobs.JOB_IDENT;

*Q3: Redo the previous query, using shorter aliases for table names.*

In [ ]:
select * from employees E, jobs J;
where E.JOB_ID = J.JOB_IDENT;

*Q4: Redo the previous query, but retrieve only the Employee ID, Employee Name and Job Title.*

In [ ]:
select EMP_ID,F_NAME,L_NAME, JOB_TITLE from employees E, jobs J where E.JOB_ID = J.JOB_IDENT;

*Q5: Redo the previous query, but specify the fully qualified column names with aliases in the SELECT clause.*

In [ ]:
select E.EMP_ID,E.F_NAME,E.L_NAME, J.JOB_TITLE
from employees E, jobs J;
where E.JOB_ID = J.JOB_IDENT;

## SQL Joins

In [ ]:
Table 1- CUSTOMERS 
+----+----------+-----+-----------+----------+
| ID | NAME     | AGE | ADDRESS   | SALARY   |
+----+----------+-----+-----------+----------+
|  1 | Ramesh   |  32 | Ahmedabad |  2000.00 |
|  2 | Khilan   |  25 | Delhi     |  1500.00 |
|  3 | kaushik  |  23 | Kota      |  2000.00 |
|  4 | Chaitali |  25 | Mumbai    |  6500.00 |
|  5 | Hardik   |  27 | Bhopal    |  8500.00 |
|  6 | Komal    |  22 | MP        |  4500.00 |
|  7 | Muffy    |  24 | Indore    | 10000.00 |
+----+----------+-----+-----------+----------+

In [ ]:
Table 2-ORDERS

+-----+---------------------+-------------+--------+
| OID | DATE                | CUSTOMER_ID | AMOUNT |
+-----+---------------------+-------------+--------+
| 102 | 2009-10-08 00:00:00 |           3 |   3000 |
| 100 | 2009-10-08 00:00:00 |           3 |   1500 |
| 101 | 2009-11-20 00:00:00 |           2 |   1560 |
| 103 | 2008-05-20 00:00:00 |           4 |   2060 |
+-----+---------------------+-------------+--------+

There are different types of joins available in SQL −

- INNER JOIN − returns rows when there is a match in both tables.

- LEFT JOIN − returns all rows from the left table, even if there are no matches in the right table.

- RIGHT JOIN − returns all rows from the right table, even if there are no matches in the left table.

- FULL JOIN − returns rows when there is a match in one of the tables.

- SELF JOIN − is used to join a table to itself as if the table were two tables, temporarily renaming at least one table in the SQL statement.

- CARTESIAN JOIN − returns the Cartesian product of the sets of records from the two or more joined tables.

### Inner joins

In [ ]:
SQL> SELECT  ID, NAME, AMOUNT, DATE
   FROM CUSTOMERS
   INNER JOIN ORDERS
   ON CUSTOMERS.ID = ORDERS.CUSTOMER_ID;

In [ ]:
+----+----------+--------+---------------------+
| ID | NAME     | AMOUNT | DATE                |
+----+----------+--------+---------------------+
|  3 | kaushik  |   3000 | 2009-10-08 00:00:00 |
|  3 | kaushik  |   1500 | 2009-10-08 00:00:00 |
|  2 | Khilan   |   1560 | 2009-11-20 00:00:00 |
|  4 | Chaitali |   2060 | 2008-05-20 00:00:00 |
+----+----------+--------+---------------------+

### Left Joins

In [ ]:
SELECT  ID, NAME, AMOUNT, DATE
FROM CUSTOMERS
LEFT JOIN ORDERS
ON CUSTOMERS.ID = ORDERS.CUSTOMER_ID;

+----+----------+--------+---------------------+
| ID | NAME     | AMOUNT | DATE                |
+----+----------+--------+---------------------+
|  1 | Ramesh   |   NULL | NULL                |
|  2 | Khilan   |   1560 | 2009-11-20 00:00:00 |
|  3 | kaushik  |   3000 | 2009-10-08 00:00:00 |
|  3 | kaushik  |   1500 | 2009-10-08 00:00:00 |
|  4 | Chaitali |   2060 | 2008-05-20 00:00:00 |
|  5 | Hardik   |   NULL | NULL                |
|  6 | Komal    |   NULL | NULL                |
|  7 | Muffy    |   NULL | NULL                |
+----+----------+--------+---------------------+

### Right Joins

In [ ]:
SELECT  ID, NAME, AMOUNT, DATE
FROM CUSTOMERS
RIGHT JOIN ORDERS
ON CUSTOMERS.ID = ORDERS.CUSTOMER_ID;

In [ ]:
+------+----------+--------+---------------------+
| ID   | NAME     | AMOUNT | DATE                |
+------+----------+--------+---------------------+
|    3 | kaushik  |   3000 | 2009-10-08 00:00:00 |
|    3 | kaushik  |   1500 | 2009-10-08 00:00:00 |
|    2 | Khilan   |   1560 | 2009-11-20 00:00:00 |
|    4 | Chaitali |   2060 | 2008-05-20 00:00:00 |
+------+----------+--------+---------------------+

### Full Joins

In [ ]:
SELECT  ID, NAME, AMOUNT, DATE
FROM CUSTOMERS
FULL JOIN ORDERS
ON CUSTOMERS.ID = ORDERS.CUSTOMER_ID;

In [ ]:
+------+----------+--------+---------------------+
| ID   | NAME     | AMOUNT | DATE                |
+------+----------+--------+---------------------+
|    1 | Ramesh   |   NULL | NULL                |
|    2 | Khilan   |   1560 | 2009-11-20 00:00:00 |
|    3 | kaushik  |   3000 | 2009-10-08 00:00:00 |
|    3 | kaushik  |   1500 | 2009-10-08 00:00:00 |
|    4 | Chaitali |   2060 | 2008-05-20 00:00:00 |
|    5 | Hardik   |   NULL | NULL                |
|    6 | Komal    |   NULL | NULL                |
|    7 | Muffy    |   NULL | NULL                |
|    3 | kaushik  |   3000 | 2009-10-08 00:00:00 |
|    3 | kaushik  |   1500 | 2009-10-08 00:00:00 |
|    2 | Khilan   |   1560 | 2009-11-20 00:00:00 |
|    4 | Chaitali |   2060 | 2008-05-20 00:00:00 |
+------+----------+--------+---------------------+

If your Database does not support FULL JOIN (MySQL does not support FULL JOIN), then you can use UNION ALL clause to combine these two JOINS as shown below.

In [ ]:
SQL> SELECT  ID, NAME, AMOUNT, DATE
   FROM CUSTOMERS
   LEFT JOIN ORDERS
   ON CUSTOMERS.ID = ORDERS.CUSTOMER_ID
UNION ALL
   SELECT  ID, NAME, AMOUNT, DATE
   FROM CUSTOMERS
   RIGHT JOIN ORDERS
   ON CUSTOMERS.ID = ORDERS.CUSTOMER_ID

# Module 4: Accessing Databases using Python

### APIs used by popular SQL-based DBMS systems

Application/Database - SQL API
- MySQL - MySQL C API
- PostgreSQL - psycopg2
- IBM DB2 - ibm_db
- SQL Server - dblib API
- Database access for Microsoft Windows OS -ODBC
- Oracle - OCI
- Java - JDBC

### Writing Code using DB-API

- There is a mechanism by which the Python code communicates with the DBMS.
- The Python code connects to the database using DB-API calls.
- DB-API is Python's standard API for accessing relational databases.
- It is a standard that allows you to write a single program that works with multiple kinds of relational databases instead of writing a separate program for each one.

### Concepts of the Python DB API

**Connections Objects**
- Database connections
- Manage transactions

**Cursor Objects**
- Database Queries
- Scroll through result set
- Retrieve results

- The DB_API includes a connect constructor for creating a connection to the database.
- It returns a Connection Object, which is then used by the various connection methods.

### Connection Methods

- **.cursor()** method: returns a new cursor object using the connection.
- **.commit()** method: commit any pending transaction to the database.
- **.rollback()** method: causes the database to roll back to the start of any pending transaction.
- **.close()** method: close a database connection.
    
- These objects represent a database cursor, which is used to manage the content of a fetch operation.

### Cursor Methods

- .callproc()
- .execute()
- .executemany()
- .fetchone()
- .fetchmany()
- .fetchall()
- .nextset()
- .arraysize()
- .close()

- Cursors created from the same connection are not isolated that is, any changes done to the database by a cursor are immediately visible by the other cursors.
- Cursors created from different connections can or cannot be isolated depending on how the transaction support is implemented.
- A database cursor is a control structure that enables traversal over the records in a database.
- It behaves like a file name or file handle in a programming language.
- Just as a program opens a file to access its contents, it opens a cursor to gain access to the query results.
- Another similarity is that just as file handle keeps track of the program's current position within an open file, a cursor keeps track of the program's current position within the query results.

In [ ]:
#import your database module by using the connect API from that module.
from dbmodule import connect

#Create connection object
Connection = connect('databasename','username','pswd')

#Create a cursor object
Cursor = connection.cursor()

#Run Queries
Cursor.execute('select * from mytable')

#Fetch results
Results=cursor.fetchall()

#Free resources
Cursor.close()

Connection.close()

## Connection to a Database using ibm_db API

- ibm_db API provides a variety of useful Python functions for accessing and manipulating data in an IBM data server database, including 
    - functions for connecting to a database
    - preparing and issuing SQL statements
    - fetching rows from result sets
    - calling stored procedures
    - committing and rolling back transactions
    - handling errors
    - retrieving metadata.
   
- The ibm_db API uses the IBM Data Server Driver for ODBC, and CLI APIs to connect to IBM, DB2, and Informix.

**Refers to Hands on Lab**: 
- DB0201EN-Week3-1-1-Connecting
- DB0201EN-Week3-1-2-Querying

## Introducing SQL Magic

- Jupyter notebooks have a concept of Magic commands that can simplify working with Python, and are particularly useful for data analysis. Your notebooks can have two types of magic commands:

- **Cell magics** : start with a double %% sign and apply to the entire cell

- **Line magics**: start with a single % (percent) sign and apply to a particular line in a cell

For example if you want to execute the a query to select some data from a table and fetch its results, you can simply enter a command like the following in your Jupyter notebook cell:

**%sql select * from tablename**

**Refers to Hands on Lab**: 
- DB0201EN-Week3-1-3-SQLmagic

Congratulations! You have completed this lesson. At this point in the course, you know:


- You can access a database from a language like Python by using the appropriate API. Examples include ibm_db API for IBM DB2, psycopg2 for ProstgreSQL, and dblib API for SQL Server.

- DB-API is Python's standard API for accessing relational databases. It allows you to write a single program that works with multiple kinds of relational databases instead of writing a separate program for each one.

- The DB_API connect constructor creates a connection to the database and returns a Connection Object, which is then used by the various connection methods.

- The connection methods are: The cursor() method, which returns a new cursor object using the connection. The commit() method, which is used to commit any pending transaction to the database. The rollback() method, which causes the database to roll-back to the start of any pending transaction. The close() method, which is used to close a database connection.

- You can use SQL Magic commands to execute queries more easily from Jupyter Notebooks. Magic commands have the general format %sql select * from tablename. Cell magics start with a double %% (percent) sign and apply to the entire cell. Line magics start with a single % (percent) sign and apply to a particular line in a cell.